Revit 2027 API
Document.GetWorksetId Method
 Get Id of the Workset which owns the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId GetWorksetId(
	ElementId id
)
Public Function GetWorksetId (
	id As ElementId
) As WorksetId
public:
WorksetId^ GetWorksetId(
	ElementId^ id
)
member GetWorksetId :
        id : ElementId -> WorksetId
Parameters
id ElementId
 Id of the element.
Return Value
WorksetId
 Id of the Workset which owns the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Each element belongs to one and only one workset.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace